app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-02-13 06:14:55.698852"], ["id", 1]]
---
  def update
    #raise params.inspect
    @article = Article.find_by(id: params[:id])
    updated = @article.update(title: params[:article][:title], description: params[:article][:description])